Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Skipped the %@ setting, which this server does not recognize.
fr: J'ai sauté la configuration %@, que ce serveur ne reconnaît pas.
ko: 이 서버가 인식하지 못하는 %@ 설정을 건너뛰었습니다.
tr: Bu sunucunun tanımadığı %@ ayarı atlandı.
vi: Đã bỏ qua thiết lập %@ mà máy chủ này không nhận ra.
zh_hans: 已跳过此服务器无法识别的 %@ 设置。
zh_hant: 已略過此伺服器無法辨識的 %@ 設定。

source: No connections have the selected tags.
fr: Aucune connexion n'a les balises sélectionnées.
ko: 선택한 태그가 있는 연결이 없습니다.
tr: Seçili etiketlere sahip bağlantı yok.
vi: Không có kết nối nào mang các thẻ đã chọn.
zh_hans: 没有连接带有所选标签。
zh_hant: 沒有連線帶有所選標籤。

source: Row fields appear once the connection is up
fr: Les champs de rang apparaissent une fois la connexion établie.

source: Add Row
fr: Ajouter une ligne
ko: 행 추가
tr: Satır Ekle
vi: Thêm dòng
zh_hans: 添加行
zh_hant: 新增列

source: No License Information
fr: Aucune information sur la licence
ko: 라이선스 정보 없음
tr: Lisans Bilgisi Yok
vi: Không có thông tin giấy phép
zh_hans: 没有许可证信息
zh_hant: 沒有授權資訊

source: CSV/JSON Editing
fr: Modification CSV/JSON
ko: CSV/JSON 편집
tr: CSV/JSON Düzenleme
vi: Chỉnh sửa CSV/JSON
zh_hans: CSV/JSON 编辑
zh_hant: CSV/JSON 編輯

source: New Trigger
fr: Nouveau déclencheur
ko: 새 트리거
tr: Yeni Tetikleyici
vi: Trigger mới
zh_hans: 新建触发器
zh_hant: 新增觸發器

source: MQL Preview
fr: Aperçu MQL
ko: MQL 미리보기
tr: MQL Önizleme
vi: Xem trước MQL
zh_hans: MQL 预览
zh_hant: MQL 預覽

source: Border
fr: Frontière
ko: 테두리
tr: Kenarlık
vi: Viền
zh_hans: 边框
zh_hant: 邊框

source: Review a query before it runs
fr: Examinez une requête avant qu'elle ne soit exécutée.
ko: 실행 전 쿼리 검토
tr: Bir sorguyu çalışmadan önce incele
vi: Rà soát một truy vấn trước khi chạy
zh_hans: 在查询运行前先审查它
zh_hant: 在查詢執行前先審查它

source: Show Inspector
fr: Afficher l'inspecteur
ko: 인스펙터 보기
tr: Denetçiyi Göster
vi: Hiện thanh kiểm tra
zh_hans: 显示检查器
zh_hant: 顯示檢閱器

source: Cannot save changes to '%1$@'. %2$@
fr: Impossible d'enregistrer les modifications à '%1$@'. %2$@

source: Import from AWS
fr: Importer depuis AWS

source: Forget All
fr: Oublier tout
ko: 모두 신뢰 해제
tr: Tümünü Unut
vi: Quên tất cả
zh_hans: 全部忘记
zh_hant: 全部忘記

source: A quote or parenthesis in this filter is not closed.
fr: Une citation ou une parenthèse dans ce filtre n'est pas fermée.

source: The server ended the session.
fr: Le serveur a terminé la session.

source: Fetch All Rows
fr: Récupérer toutes les lignes
ko: 모든 행 가져오기
tr: Tüm Satırları Getir
vi: Tải tất cả dòng
zh_hans: 获取所有行
zh_hant: 取得所有列

source: That is not an HTTP address.
fr: Ce n'est pas une adresse HTTP.

source: Tab label
fr: Étiquette de la barre d'onglets
ko: 탭 레이블
tr: Sekme etiketi
vi: Nhãn tab
zh_hans: 标签页标签
zh_hant: 標籤頁標籤

source: No selection
fr: Aucune sélection
ko: 선택 항목 없음
tr: Seçim yok
vi: Chưa chọn
zh_hans: 未选择
zh_hant: 未選取

source: Show Welcome Screen
fr: Afficher l'écran d'accueil
ko: 시작 화면 보기
tr: Hoş Geldiniz Ekranını Göster
vi: Hiện màn hình chào mừng
zh_hans: 显示欢迎屏幕
zh_hant: 顯示歡迎畫面

source: Add Another SQL Folder...
fr: Ajouter un autre dossier SQL...
ko: 다른 SQL 폴더 추가...
tr: Başka Bir SQL Klasörü Ekle...
vi: Thêm thư mục SQL khác...
zh_hans: 添加其他SQL文件夹...
zh_hant: 新增其他 SQL 資料夾…

source: A value was too large to keep.
fr: Une valeur était trop grande pour être conservée.
ko: 값이 너무 커서 보관할 수 없었습니다.
tr: Bir değer saklanamayacak kadar büyüktü.
vi: Một giá trị quá lớn để giữ lại.
zh_hans: 有一个值太大，无法保留。
zh_hant: 有一個值太大，無法保留。

source: This deletes only the queries listed here, from this connection. Queries the source, date, outcome and search filters are hiding stay. You cannot undo this.
fr: Cela supprime uniquement les requêtes listées ici, de cette connexion. Les requêtes qui cachent la source, la date, le résultat et les filtres de recherche restent inchangées. Vous ne pouvez pas annuler cela.
ko: 여기에 나열된 쿼리만 이 연결에서 삭제합니다. 소스, 날짜, 결과 및 검색 필터로 숨겨진 쿼리는 유지됩니다. 이 작업은 실행 취소할 수 없습니다.
tr: Bu, yalnızca burada listelenen sorguları bu bağlantıdan siler. Kaynak, tarih, sonuç ve arama filtrelerinin gizlediği sorgular kalır. Bu işlem geri alınamaz.
vi: Thao tác này chỉ xoá các truy vấn được liệt kê ở đây, từ kết nối này. Các truy vấn đang bị bộ lọc nguồn, ngày, kết quả và tìm kiếm ẩn đi sẽ được giữ lại. Bạn không thể hoàn tác.
zh_hans: 这只会删除此处列出的查询，仅限此连接。被来源、日期、结果和搜索筛选隐藏的查询会保留。此操作无法撤销。
zh_hant: 這只會刪除此處列出的查詢，僅限此連線。被來源、日期、結果和搜尋篩選隱藏的查詢會保留。此動作無法復原。

source: No activity yet
fr: Pas d'activité encore
ko: 아직 활동 없음
tr: Henüz etkinlik yok
vi: Chưa có hoạt động
zh_hans: 暂无活动
zh_hant: 尚無活動

source: Rows to insert, each an array aligned with 'columns'
fr: Rangs à insérer, chacun étant un tableau aligné sur les "colonnes"
ko: 삽입할 행이며 각 행은 'columns'와 정렬된 배열입니다
tr: Eklenecek satırlar, her biri 'columns' ile hizalanmış bir dizi
vi: Các dòng cần chèn, mỗi dòng là một mảng khớp với 'columns'
zh_hans: 要插入的行，每行是与 'columns' 对齐的数组
zh_hant: 要插入的列，每列是與 'columns' 對齊的陣列

source: No functions
fr: Aucune fonction
ko: 함수 없음
tr: Fonksiyon yok
vi: Không có hàm
zh_hans: 没有函数
zh_hant: 沒有函式

source: Failed to load template: %@
fr: Impossible de charger le modèle : %@
ko: 템플릿을 불러오지 못했습니다: %@
tr: Şablon yüklenemedi: %@
vi: Tải mẫu thất bại: %@
zh_hans: 加载模板失败: %@
zh_hant: 載入範本失敗：%@

source: Table Favorites
fr: Favoris de table
ko: 테이블 즐겨찾기
tr: Tablo Favorileri
vi: Bảng yêu thích
zh_hans: 表收藏
zh_hant: 資料表收藏

source: Required
fr: Requis

source: Active Sessions
fr: Sessions actives
ko: 활성 세션
tr: Aktif Oturumlar
vi: Phiên đang hoạt động
zh_hans: 活跃会话
zh_hant: 使用中的工作階段

source: Backup Dump…
fr: Dépôt de sauvegarde...
ko: 백업 덤프…
tr: Yedek Dökümü…
vi: Dump sao lưu…
zh_hans: 备份转储…
zh_hant: 正在備份資料庫…

source: Changed
fr: Changé
ko: 변경됨
tr: Değişti
vi: Đã thay đổi
zh_hans: 已更改
zh_hant: 已變更

source: Server
fr: Serveur
ko: 서버
vi: Máy chủ
zh_hans: 服务器
zh_hant: 伺服器

source: Execute a destructive DDL query (DROP, TRUNCATE, ALTER...DROP) after explicit confirmation.
fr: Exécuter une requête DDL destructrice (DROP, TRUNCATE, ALTER...DROP) après confirmation explicite.
ko: 명시적으로 확인한 후 파괴적 DDL 쿼리(DROP, TRUNCATE, ALTER...DROP)를 실행합니다.
tr: Açık onaydan sonra yıkıcı bir DDL sorgusu (DROP, TRUNCATE, ALTER...DROP) çalıştırır.
vi: Thực thi truy vấn DDL phá hủy (DROP, TRUNCATE, ALTER...DROP) sau khi xác nhận rõ ràng.
zh_hans: 在明确确认后执行破坏性 DDL 查询（DROP、TRUNCATE、ALTER...DROP）。
zh_hant: 在明確確認後執行破壞性 DDL 查詢（DROP、TRUNCATE、ALTER...DROP）。

source: Choose a folder to watch for .tablepro connection files
fr: Choisissez un dossier pour surveiller les fichiers de connexion .tablepro.
ko: .tablepro 연결 파일을 감시할 폴더 선택
tr: .tablepro bağlantı dosyalarını izlemek için bir klasör seçin
vi: Chọn thư mục để theo dõi tệp kết nối .tablepro
zh_hans: 选择要监视 .tablepro 连接文件的文件夹
zh_hant: 選擇要監看 .tablepro 連線檔案的資料夾

source: No privileges can be granted at this level.
fr: Aucun privilège ne peut être accordé à ce niveau.
ko: 이 수준에서는 부여할 수 있는 권한이 없습니다.
tr: Bu düzeyde yetki verilemez.
vi: Không thể cấp quyền ở cấp này.
zh_hans: 此级别无法授予任何权限。
zh_hant: 此層級無法授予任何權限。

source: Sent
fr: Envoyé

source: Select filter operator
fr: Sélectionnez l'opérateur de filtre
ko: 필터 연산자 선택
tr: Filtre operatörü seç
vi: Chọn toán tử lọc
zh_hans: 选择筛选运算符
zh_hant: 選擇篩選運算子

source: No Element Selected
fr: Aucun élément sélectionné

source: Support TablePro
fr: Soutien TablePro
ko: TablePro 후원
tr: TablePro'yu Destekle
vi: Ủng hộ TablePro
zh_hans: 支持 TablePro
zh_hant: 支持 TablePro

source: Operation name to pass to run_maintenance
fr: Nom de l'opération à transmettre à run_maintenance

source: Your team will see the names and SQL of %d saved queries. This replaces what you previously published.
fr: Votre équipe verra les noms et les SQL des %d requêtes enregistrées. Cela remplace ce que vous avez précédemment publié.
ko: 팀에서 저장된 쿼리 %d개의 이름과 SQL을 볼 수 있습니다. 이전에 게시한 내용은 이 내용으로 대체됩니다.
tr: Takımınız %d kayıtlı sorgunun adlarını ve SQL'ini görecek. Bu, daha önce yayınladıklarınızın yerini alır.
vi: Nhóm của bạn sẽ thấy tên và SQL của %d truy vấn đã lưu. Nội dung này thay thế những gì bạn đã xuất bản trước đó.
zh_hans: 你的团队将看到 %d 条已保存查询的名称和 SQL。这会替换你之前发布的内容。
zh_hant: 你的團隊將看到 %d 條已儲存查詢的名稱和 SQL。這會取代你先前發佈的內容。

source: The target returned an empty definition.
fr: La cible a renvoyé une définition vide.

source: Find tables, views and columns whose name contains a substring, and the schema each one is in. Without 'schema', tables and views are searched in every schema and columns in the current one; name a schema to search only that schema, columns included.
fr: Trouvez des tables, des vues et des colonnes dont le nom contient une sous-chaîne, et le schéma dans lequel elles se trouvent. Sans "schema", les tables et les vues sont recherchées dans chaque schéma et les colonnes du schéma actuel ; nommez un schéma pour rechercher uniquement ce schéma, y compris les colonnes.

source: Duplicate index name: %@
fr: Nom d'index duplicé : %@

source: "%@" was changed since you opened it. Review the diff and choose how to resolve.
fr: «%@» a été modifié depuis que vous l’avez ouvert. Consultez les différences et choisissez comment résoudre le conflit.
ko: "%@" 항목이 열린 후 변경되었습니다. 차이점을 검토하고 해결 방법을 선택하십시오.
tr: "%@" siz açtıktan sonra değiştirildi. Farkları inceleyin ve nasıl çözeceğinizi seçin.
vi: "%@" đã thay đổi kể từ khi bạn mở. Xem lại phần khác biệt và chọn cách xử lý.
zh_hans: "%@"在您打开后已被更改。请查看差异并选择处理方式。
zh_hant: 「%@」在你開啟後已被變更。請查看差異並選擇處理方式。

source: Databases
fr: Base de données
ko: 데이터베이스
tr: Veritabanları
vi: Cơ sở dữ liệu
zh_hans: 数据库
zh_hant: 資料庫

source: Always 'created' on success
fr: Toujours "créé" sur le succès
ko: 성공 시 항상 'created'
tr: Başarılı olduğunda her zaman 'created'
vi: Luôn là 'created' khi thành công
zh_hans: 成功时始终为 'created'
zh_hant: 成功時一律為 'created'

source: A filter is one expression. Remove the semicolon.
fr: Un filtre est une expression. Supprimez le point-virgule.

source: switch schema
fr: schema de commutation
ko: 스키마 전환
tr: şema değiştir
vi: chuyển schema
zh_hans: 切换 Schema
zh_hant: 切換綱要

source: Added
fr: Supplémentaire
ko: 추가됨
tr: Eklendi
vi: Đã thêm
zh_hans: 新增
zh_hant: 新增

source: The source and the target have no table of the same name.
fr: La source et la cible n'ont pas de table du même nom.

source: Caption
fr: Légende
ko: 캡션
tr: Başlık
vi: Chú thích
zh_hans: 标题说明
zh_hant: 標題說明

source: Compare & Sync With…
fr: Comparer et synchroniser avec...
ko: 다음과 비교 및 동기화…
tr: Şununla Karşılaştır ve Eşitle…
vi: So sánh & Đồng bộ với…
zh_hans: 与之比较与同步…
zh_hant: 與之比較與同步…

source: Keep leading zeros in ZIP codes, phone numbers, and IDs by outputting all values as strings
fr: Gardez les zéros précédents dans les codes postaux, les numéros de téléphone et les identifiants en affichant tous les valeurs sous forme de chaînes de caractères.
ko: 우편번호, 전화번호 및 ID의 앞자리 0을 유지하려면 모든 값을 문자열로 출력합니다
vi: Giữ số 0 đầu trong mã bưu chính, số điện thoại và ID bằng cách xuất tất cả giá trị dưới dạng chuỗi
zh_hans: 通过将所有值输出为字符串来保留邮编、电话号码和 ID 中的前导零
zh_hant: 將所有值輸出為字串,以保留郵遞區號、電話號碼和 ID 中的前導零

source: Whether the limit clipped the matches
fr: Que le limite ait coupé les matchs
ko: 제한 때문에 일치 항목이 잘렸는지 여부
tr: Sınırın eşleşmeleri kırpıp kırpmadığı
vi: Giới hạn có cắt bớt kết quả khớp hay không
zh_hans: 该限制是否截断了匹配项
zh_hant: 該限制是否截斷了符合項目

source: This action needs ⌘ or ⌃. Option and Shift can join them, but cannot hold a shortcut on their own.
fr: Cette action nécessite ⌘ ou ⌃. Option et Maj peuvent les joindre, mais ne peuvent pas maintenir une raccourci par elles-mêmes.
ko: 이 동작에는 ⌘ 또는 ⌃가 필요합니다. Option과 Shift는 함께 쓸 수는 있지만 단독으로 단축키를 이룰 수 없습니다.
tr: Bu eylem ⌘ veya ⌃ gerektirir. Option ve Shift bunlara eşlik edebilir, ama tek başlarına bir kısayol tutamaz.
vi: Hành động này cần ⌘ hoặc ⌃. Option và Shift có thể đi kèm, nhưng không thể tự mình giữ một phím tắt.
zh_hans: 此操作需要 ⌘ 或 ⌃。Option 和 Shift 可以搭配它们，但不能单独构成快捷键。
zh_hant: 此操作需要 ⌘ 或 ⌃。Option 和 Shift 可以搭配它們，但不能單獨構成快速鍵。

source: %1$d will be restored, %2$d left alone
fr: %1$d sera restauré, %2$d restera seul
ko: %1$d개는 복원되고 %2$d개는 그대로 둡니다
tr: %1$d tanesi geri yüklenecek, %2$d tanesine dokunulmayacak
vi: %1$d sẽ được khôi phục, %2$d giữ nguyên
zh_hans: 将恢复 %1$d 个，保留 %2$d 个不变
zh_hant: 將還原 %1$d 個，保留 %2$d 個不變

source: No Favorites
fr: Pas de favoris
ko: 즐겨찾기 없음
tr: Favori Yok
vi: Không có mục yêu thích
zh_hans: 无收藏
zh_hant: 無我的最愛

source: connected
fr: connecté
ko: 연결됨
tr: bağlı
vi: đã kết nối
zh_hans: 已连接
zh_hant: 已連線

source: Routines, sorted by qualified name
fr: Routines, triées par nom qualifié
ko: 정규화된 이름순으로 정렬된 루틴
tr: Nitelikli ada göre sıralanmış rutinler
vi: Các routine, sắp xếp theo tên đầy đủ
zh_hans: 按限定名排序的例程
zh_hant: 按限定名稱排序的常式

source: Some values come from Ruby code and were not read
fr: Certains valeurs proviennent du code Ruby et n'ont pas été lus.
ko: 일부 값은 Ruby 코드에서 가져왔으며 읽지 못했습니다
tr: Bazı değerler Ruby kodundan geliyor ve okunmadı
vi: Một số giá trị đến từ mã Ruby và không được đọc
zh_hans: 部分值来自 Ruby 代码，未被读取
zh_hant: 部分值來自 Ruby 程式碼，未被讀取

source: %@ requires a Pro license
fr: %@ nécessite une licence Pro
ko: %@에는 Pro 라이선스가 필요합니다
tr: %@ için Pro lisans gereklidir
vi: %@ yêu cầu giấy phép Pro
zh_hans: %@ 需要 Pro 许可证
zh_hant: %@ 需要 Pro 授權

source: Saved Filters
fr: Filtres enregistrés

source: Tiny
fr: Tout petit
ko: 매우 작게
vi: Rất nhỏ
zh_hans: 极小
zh_hant: 極小

source: Couldn't publish to the team library
fr: Impossible de publier dans la bibliothèque de l'équipe
ko: 팀 라이브러리에 게시할 수 없습니다
tr: Takım kitaplığına yayınlanamadı
vi: Không thể xuất bản lên thư viện nhóm
zh_hans: 无法发布到团队库
zh_hant: 無法發佈到團隊庫

source: Partly selected
fr: Partiellement sélectionné

source: Keeps the last %d versions on this Mac.
fr: Gardez les dernières %d versions sur ce Mac.

source: This license expires today.
fr: Cette licence expire aujourd'hui.
ko: 이 라이선스는 오늘 만료됩니다.
tr: Bu lisansın süresi bugün doluyor.
vi: Giấy phép này hết hạn hôm nay.
zh_hans: 此许可证今天过期。
zh_hant: 此授權今天到期。

source: pending delete
fr: Suppression en attente
ko: 삭제 대기 중
tr: silinmeyi bekliyor
vi: chờ xóa
zh_hans: 待删除
zh_hant: 待刪除

source: AWS IAM
fr: IAM AWS

source: Executable path
fr: Chemin exécutable

# Signed in as %@ on the %@ plan.
source: Signed in as %1$@ on the %2$@ plan.
fr: Connecté en tant que %1$@ sur le forfait %2$@.
ko: %1$@ 계정으로 로그인했습니다. 현재 %2$@ 요금제를 사용 중입니다.
tr: %2$@ planıyla %1$@ olarak oturum açıldı.
vi: Đã đăng nhập với tên %1$@ trên gói %2$@.
zh_hans: 已以 %1$@ 身份登录，使用 %2$@ 方案。
zh_hant: 已以 %1$@ 身分登入，使用 %2$@ 方案。

source: Unset
fr: Non réglé
ko: 설정 안 됨
vi: Bỏ đặt
zh_hans: 取消设置
zh_hant: 取消設定

source: %@ changed after it was compared. Compare again before generating the script.
fr: %@ a changé après avoir été comparé. Comparez à nouveau avant de générer le script.

# Restored “%@” from %@
source: Restored “%1$@” from %2$@
fr: Restauration de "%1$@" à partir de %2$@
ko: %2$@에서 “%1$@” 복원을 완료했습니다
tr: “%1$@” şuradan geri yüklendi: %2$@
vi: Đã khôi phục “%1$@” từ %2$@
zh_hans: 已从%2$@恢复“%1$@”
zh_hant: 已從 %1$@ 還原「%2$@」

source: Copy Operation
fr: Opération de copie
ko: 연산 복사
tr: İşlemi Kopyala
vi: Sao chép thao tác
zh_hans: 复制操作
zh_hant: 複製操作

source: Select a dump file this engine's own tool wrote.
fr: Sélectionnez un fichier de décompilation écrit par l'outil de ce moteur.

source: is NULL
fr: Est NULL
ko: NULL임
vi: là NULL
zh_hans: 为 NULL
zh_hant: 為 NULL

source: Default Operator
fr: Opérateur par défaut
ko: 기본 연산자
tr: Varsayılan Operatör
vi: Toán tử mặc định
zh_hans: 默认运算符
zh_hant: 預設運算子

source: Time Zone
fr: Fuseau horaire
ko: 시간대
tr: Saat Dilimi
vi: Múi giờ
zh_hans: 时区
zh_hant: 時區

source: Category
fr: Catégorie
ko: 카테고리
tr: Kategori
vi: Danh mục
zh_hans: 分类
zh_hant: 分類

source: Point at latitude %1$.5f, longitude %2$.5f
fr: Point à la latitude %1$.5f, longitude %2$.5f

source: New Table…
fr: Nouvelle table...
ko: 새 테이블…
tr: Yeni Tablo…
vi: Bảng mới…
zh_hans: 新建表…
zh_hant: 新增資料表…

source: Port 1455 is in use. Quit the Codex CLI or another sign-in and try again.
fr: Le port 1455 est en cours d'utilisation. Quittez le Codex CLI ou une autre connexion et réessayez.
ko: 포트 1455가 사용 중입니다. Codex CLI 또는 다른 로그인 세션을 종료한 후 다시 시도하십시오.
tr: 1455 portu kullanımda. Codex CLI’yi veya başka bir girişi kapatın ve tekrar deneyin.
vi: Cổng 1455 đang được sử dụng. Hãy thoát Codex CLI hoặc một phiên đăng nhập khác rồi thử lại.
zh_hans: 端口 1455 正在使用中。请退出 Codex CLI 或其他登录后重试。
zh_hant: 連接埠 1455 正在使用中。請結束 Codex CLI 或其他登入後再試一次。

source: Changing which rows are shown will discard all unsaved changes.
fr: La modification des lignes affichées supprimera toutes les modifications non enregistrées.

source: Session contexts
fr: Contexte de session
ko: 세션 컨텍스트
tr: Oturum bağlamları
vi: Các context phiên
zh_hans: 会话上下文
zh_hant: 工作階段情境

source: iCloud Sync
fr: Synchronisation iCloud
ko: iCloud 동기화
tr: iCloud Eşitlemesi
vi: Đồng bộ iCloud
zh_hans: iCloud 同步
zh_hant: iCloud 同步

source: Ignore case
fr: Ignorer la casse

source: Add columns first
fr: Ajoutez d'abord des colonnes
ko: 먼저 열을 추가하십시오
tr: Önce sütun ekleyin
vi: Thêm cột trước
zh_hans: 请先添加列
zh_hant: 請先新增欄位

source: Not Installed
fr: Non installé
ko: 설치되지 않음
tr: Yüklü Değil
vi: Chưa cài đặt
zh_hans: 未安装
zh_hant: 未安裝

source: %1$@ cannot be part of a key here, so the column is created as %2$@.
fr: %1$@ ne peut pas faire partie d'une clé ici, donc la colonne est créée comme %2$@.

source: Comment
fr: Commentaire
ko: 주석
tr: Yorum
vi: Ghi chú
zh_hans: 注释
zh_hant: 註解

source: Read Only Connection
fr: Connexion en lecture seule
ko: 읽기 전용 연결
tr: Salt Okunur Bağlantı
vi: Kết nối chỉ đọc
zh_hans: 只读连接
zh_hant: 唯讀連線

source: Manage Profiles…
fr: Gérer les profils...

source: Choose a Database
fr: Choisissez une base de données
ko: 데이터베이스 선택
tr: Bir veritabanı seçin
vi: Chọn cơ sở dữ liệu
zh_hans: 选择数据库
zh_hant: 選擇資料庫

source: Failed to parse any columns from table '%@'. Check console for debug info.
fr: Impossible de parser des colonnes de la table '%@'. Vérifiez la console pour obtenir des informations de débogage.
ko: 테이블 '%@'에서 열을 하나도 구문 분석하지 못했습니다. 디버그 정보는 콘솔에서 확인하십시오.
tr: Failed to parse any columns from tablo '%@'. Check console for debug info.
vi: Không thể phân tích cột từ bảng '%@'. Kiểm tra console để xem thông tin gỡ lỗi.
zh_hans: 无法从表 '%@' 解析任何列。请检查控制台获取调试信息。
zh_hant: 無法從資料表「%@」解析任何欄位。請檢查主控台以取得偵錯資訊。

source: Drop selected partition
fr: Déposer la partition sélectionnée
ko: 선택한 파티션 삭제
tr: Seçili bölümü sil
vi: Xoá phân vùng đã chọn
zh_hans: 删除选定的分区
zh_hant: 刪除選取的分割區

source: Open Schema…
fr: Schéma ouvert...
ko: 스키마 열기…
tr: Şemayı Aç…
vi: Mở schema…
zh_hans: 打开 Schema…
zh_hant: 開啟綱要…

source: 1 visible row
fr: 1 rang visible

source: Last Hour
fr: Dernière heure
ko: 최근 1시간
tr: Son Bir Saat
vi: 1 giờ qua
zh_hans: 最近 1 小时
zh_hant: 最近 1 小時

source: Choose a certificate or key file
fr: Choisissez un certificat ou un fichier clé
ko: 인증서 또는 키 파일 선택
tr: Sertifika veya anahtar dosyası seçin
vi: Chọn tệp chứng chỉ hoặc key
zh_hans: 选择证书或密钥文件
zh_hant: 選擇憑證或金鑰檔案

source: ISO 8601 last activity time
fr: Heure de dernière activité ISO 8601
ko: ISO 8601 마지막 활동 시각
tr: ISO 8601 son etkinlik zamanı
vi: Thời điểm hoạt động cuối theo ISO 8601
zh_hans: ISO 8601 最后活动时间
zh_hant: ISO 8601 最後活動時間

source: Open Source Libraries
fr: Bibliothèques open source
ko: 오픈 소스 라이브러리
tr: Açık Kaynak Kitaplıklar
vi: Thư viện mã nguồn mở
zh_hans: 开源库
zh_hant: 開源程式庫

source: Inserted
fr: Inséré
ko: 삽입됨
tr: Eklendi
vi: Đã chèn
zh_hans: 已插入
zh_hant: 已插入

source: TLS handshake failed: %@
fr: Échec de la poignée de main TLS : %@
ko: TLS 핸드셰이크 실패: %@
tr: TLS el sıkışması başarısız: %@
vi: Bắt tay TLS thất bại: %@
zh_hans: TLS 握手失败：%@
zh_hant: TLS 交握失敗：%@

source: Parameters
fr: Paramètres
ko: 매개변수
tr: Parametreler
vi: Tham số
zh_hans: 参数
zh_hant: 參數

source: Some tables have not been compared with the columns now chosen.
fr: Certaines tables n'ont pas été comparées aux colonnes maintenant choisies.
ko: 지금 선택한 열로 아직 비교하지 않은 테이블이 있습니다.
tr: Bazı tablolar şu anda seçili sütunlarla karşılaştırılmadı.
vi: Một số bảng chưa được so sánh với các cột đang chọn.
zh_hans: 有些表尚未按当前选择的列进行比较。
zh_hant: 有些資料表尚未按目前選擇的欄位進行比較。

source: Schema: %@
fr: Schéma : %@
ko: 스키마: %@
tr: Şema: %@
zh_hant: 綱要：%@

source: Exports data as mongosh-compatible scripts. Drop, Indexes, and Data options are configured per collection in the collection list.
fr: Exporte les données sous forme de scripts compatibles avec mongosh. Les options de dépose, d'indexation et de données sont configurées par collection dans la liste des collections.
ko: 데이터를 mongosh 호환 스크립트로 내보냅니다. Drop, Indexes 및 Data 옵션은 컬렉션 목록의 각 컬렉션에서 설정합니다.
tr: Veriyi mongosh uyumlu betikler olarak dışa aktarır. Bırak, İndeksler ve Veri seçenekleri koleksiyon listesinde koleksiyon başına yapılandırılır.
vi: Xuất dữ liệu dưới dạng script tương thích mongosh. Tùy chọn Drop, Indexes và Data được cấu hình cho từng collection trong danh sách collection.
zh_hans: 将数据导出为 mongosh 兼容的脚本。Drop、Indexes 和 Data 选项可在集合列表中按集合配置。
zh_hant: 將資料匯出為 mongosh 相容的指令碼。Drop、Indexes 與 Data 選項可在集合清單中依集合個別設定。

source: Testing connection
fr: Test de la connexion
ko: 연결 테스트 중
tr: Bağlantı test ediliyor
vi: Đang kiểm tra kết nối
zh_hans: 正在测试连接
zh_hant: 正在測試連線

source: No parts found
fr: Aucune pièce trouvée
ko: 파트를 찾을 수 없음
tr: Parça bulunamadı
vi: Không tìm thấy phân vùng
zh_hans: 未找到分区
zh_hant: 找不到分割區

source: The app stays free, all of it. If TablePro is useful to you, a license is what pays for the next release.
fr: L'application reste gratuite, tout le monde. Si TablePro vous est utile, une licence est ce qui paie la prochaine version.
ko: 앱 전체가 계속 무료입니다. TablePro가 쓸모 있었다면, 라이선스가 다음 릴리스를 만듭니다.
tr: Uygulamanın tamamı ücretsiz kalır. TablePro işinize yarıyorsa, bir sonraki sürümü lisanslar finanse eder.
vi: Toàn bộ ứng dụng vẫn miễn phí. Nếu TablePro hữu ích với bạn, giấy phép là thứ chi trả cho bản phát hành tiếp theo.
zh_hans: 整个 App 一直免费。如果 TablePro 对你有用，许可证支付了下一个版本的开发。
zh_hant: 整個 App 一直免費。如果 TablePro 對你有用，授權支付了下一個版本的開發。

source: No devices are activated on this license.
fr: Aucun appareil n'est activé sur cette licence.
ko: 이 라이선스로 활성화된 기기가 없습니다.
tr: Bu lisansta etkinleştirilmiş cihaz yok.
vi: Chưa có thiết bị nào được kích hoạt với giấy phép này.
zh_hans: 此许可证尚未激活任何设备。
zh_hant: 此授權尚未啟用任何裝置。

source: Copy Connection String
fr: Copier la chaîne de connexion
ko: 연결 문자열 복사
tr: Bağlantı Dizgisini Kopyala
vi: Sao chép connection string
zh_hans: 复制连接字符串
zh_hant: 複製連線字串

source: Port %lld usually requires TLS, and SSL Mode is Disabled.
fr: Le port %lld nécessite généralement TLS, et le mode SSL est désactivé.

source: How long it has run
fr: Depuis combien de temps cela fonctionne-t-il ?
ko: 실행된 시간
tr: Ne kadar süredir çalıştığı
vi: Nó đã chạy được bao lâu
zh_hans: 已经运行了多久
zh_hant: 已經執行了多久

source: Show object icons
fr: Afficher les icônes des objets
ko: 객체 아이콘 보기
tr: Nesne simgelerini göster
vi: Hiện biểu tượng đối tượng
zh_hans: 显示对象图标
zh_hant: 顯示物件圖像

source: Everyone on your team will see the host, port, user, database and SSH settings. This replaces the connections and saved queries you published before. Passwords are not included.
fr: Tout le monde de votre équipe verra les paramètres de l'hôte, du port, de l'utilisateur, de la base de données et de SSH. Cela remplace les connexions et les requêtes enregistrées que vous avez publiées auparavant. Les mots de passe ne sont pas inclus.

source: No tables found
fr: Aucune table trouvée
ko: 테이블을 찾을 수 없음
tr: Tablo bulunamadı
vi: Không tìm thấy bảng
zh_hans: 未找到表
zh_hant: 找不到資料表

source: Use DuckLake
fr: Utilisez DuckLake
ko: DuckLake 사용
tr: DuckLake Kullan
vi: Dùng DuckLake
zh_hans: 使用 DuckLake
zh_hant: 使用 DuckLake

source: Time spent waiting
fr: Temps passé à attendre
ko: 대기 시간
tr: Beklemede geçen süre
vi: Thời gian chờ
zh_hans: 等待耗时
zh_hant: 等待耗時

source: ChatGPT did not return an access token.
fr: ChatGPT n'a pas renvoyé un jeton d'accès.
ko: ChatGPT가 액세스 토큰을 반환하지 않았습니다.
tr: ChatGPT bir erişim belirteci döndürmedi.
vi: ChatGPT không trả về mã truy cập.
zh_hans: ChatGPT 未返回访问令牌。
zh_hant: ChatGPT 未回傳存取權杖。
